scenarios/artillery.msp-unauth.yml
config:
  target: "http://localhost"
  processor: "../dist/src/processors/msp-unauth.js"
  variables:
    # IMPORTANT: keep this in sync with the total duration of all phases (seconds).
    # (10 + 20 + 40 + 60 + 10) = 140
    TEST_TOTAL_DURATION_SEC: 140

  phases:
    - name: warmup
      duration: 10
      arrivalRate: 1

    - name: ramp
      duration: 20
      arrivalRate: 1
      rampTo: 10

    - name: steady
      duration: 40
      arrivalRate: 5
      rampTo: 50

    - name: spike
      duration: 60
      arrivalRate: 50
      rampTo: 100

    - name: cooldown
      duration: 10
      arrivalRate: 6
      rampTo: 1

scenarios:
  - name: msp_unauth_load
    flow:
      - function: mspUnauthLoad