scenarios/artillery.yml
config:
  target: "http://localhost"
  processor: "../dist/src/processors/connect.js"
  variables:
    # Account derivation config (mnemonic-based)
    # - byIndex: all VUs use ACCOUNT_INDEX unless payload var `accountIndex` is provided
    # - sequential/random: uses START/COUNT
    ACCOUNT_MODE: sequential
    ACCOUNT_INDEX_START: 0
    ACCOUNT_INDEX_COUNT: 1000
  phases:
    - name: connect
      duration: 10
      arrivalRate: 10

scenarios:
  - name: sdk_connect
    flow:
      - function: connectClients